Revit 2027 API
DirectShapeReferencingOption Enumeration
 An enumerated type containing possible referencing options for DirectShapes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DirectShapeReferencingOption
Public Enumeration DirectShapeReferencingOption
public enum class DirectShapeReferencingOption
type DirectShapeReferencingOption
Members
Member name | Value | Description
NotReferenceable | 0 |  The associated DirectShape shall not be referenceable.
Referenceable | 1 |  The associated DirectShape may be dimensioned and/or otherwise referenced.
See Also
Reference
Autodesk.Revit.DB Namespace